### Testing kepler.gl

In [1]:
import pandas as pd
import geopandas as gpd
from keplergl import KeplerGl
import numpy as np

In [2]:
df = pd.read_csv("./data/data_ny_taxi.csv")
df.head(5)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,fare_amount,tip_amount,total_amount
0,2,2015-01-15 19:05:39 +00:00,2015-01-15 19:23:42 +00:00,1,1.59,-73.993896,40.750111,-73.974785,40.750618,12.0,3.25,17.05
1,2,2015-01-15 19:05:39 +00:00,2015-01-15 19:32:00 +00:00,1,2.38,-73.976425,40.739811,-73.983978,40.757889,16.5,4.38,22.68
2,2,2015-01-15 19:05:40 +00:00,2015-01-15 19:21:00 +00:00,5,2.83,-73.968704,40.754246,-73.955124,40.786858,12.5,0.00,14.30
3,2,2015-01-15 19:05:40 +00:00,2015-01-15 19:28:18 +00:00,5,8.33,-73.863060,40.769581,-73.952713,40.785782,26.0,8.08,41.21
4,2,2015-01-15 19:05:41 +00:00,2015-01-15 19:20:36 +00:00,1,2.37,-73.945541,40.779423,-73.980850,40.786083,11.5,0.00,13.30

In [3]:
df.shape

(97986, 12)

In [4]:
df.columns

Index(['VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'pickup_longitude',
       'pickup_latitude', 'dropoff_longitude', 'dropoff_latitude',
       'fare_amount', 'tip_amount', 'total_amount'],
      dtype='object')

In [5]:
# map1=KeplerGl(height=500)
# map1

In [6]:
# map1.add_data(data=df,name='New York City Taxi Trips')

In [7]:
twente = gpd.read_file("/Users/wenyuc/Desktop/UT/BIOZE/data/B73_Boerderijtypen/farm_twente.shp")

In [8]:
twente_clean = twente[['IND_OBJ_NA', 'geometry']]
twente_clean

    IND_OBJ_NA                       geometry
0       507920  POINT (249005.828 481581.281)
1       507950  POINT (253627.284 494018.877)
2       507953  POINT (255218.985 489726.124)
3       507962  POINT (247910.764 494942.485)
4       507964  POINT (229912.777 473407.567)
..         ...                            ...
277     507802  POINT (245819.210 476352.341)
278     507805  POINT (240661.922 476244.697)
279     507807  POINT (239737.061 472838.014)
280     507809  POINT (245716.332 478592.676)
281     507913  POINT (247312.710 481361.658)

[282 rows x 2 columns]

In [9]:
twente_clean.isnull().values.any()

False

In [10]:
# create fake manure data 
twente_clean['manure_qt'] = np.random.randint(10, 500, twente_clean.shape[0])

/Users/wenyuc/opt/anaconda3/envs/bioze_env/lib/python3.10/site-packages/geopandas/geodataframe.py:1538: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  super().__setitem__(key, value)

In [11]:
twente_clean

    IND_OBJ_NA                       geometry  manure_qt
0       507920  POINT (249005.828 481581.281)         73
1       507950  POINT (253627.284 494018.877)         84
2       507953  POINT (255218.985 489726.124)        271
3       507962  POINT (247910.764 494942.485)        350
4       507964  POINT (229912.777 473407.567)        206
..         ...                            ...        ...
277     507802  POINT (245819.210 476352.341)        469
278     507805  POINT (240661.922 476244.697)        484
279     507807  POINT (239737.061 472838.014)        434
280     507809  POINT (245716.332 478592.676)         83
281     507913  POINT (247312.710 481361.658)        168

[282 rows x 3 columns]

In [12]:
# twente_df = pd.DataFrame(twente)
# twente_df.head(5)

In [13]:
# twente_df['lon'] = twente['geometry'].x
# twente_df['lat'] = twente['geometry'].y

In [14]:
# fp = "/Users/wenyuc/Desktop/UT/BIOZE/data/B73_Boerderijtypen/farm_twente.csv"
# df_twente = pd.read_csv(fp)
# df_twente.head(5)

In [15]:
# twente_df_clean = twente_df[['IND_OBJ_NA', 'lon', 'lat']].rename(columns={"lon": "point_longitude", "lat": "point_latitude"})

In [16]:
# kepler does not accept csv file with null values
# twente_df_clean.isnull().values.any()

In [17]:
map2=KeplerGl(height=500)
# map2.add_data(data=twente.to_json(),name='Twente Farms') # kepler takes JSON and csv, thereby here converting GeoDataFrame to JSON
map2.add_data(data=twente_clean ,name= 'Twente Farms') # kepler actually does take GeoDataFrame, which is way easier than having to convert the crs of lat and lon in df
map2

User Guide: https://docs.kepler.gl/docs/keplergl-jupyter

KeplerGl(data={'Twente Farms': {'index': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19…

In [18]:
map2.save_to_html(file_name='first_map.html')

Map saved to first_map.html!